jike123456/stm32-freertos-robot/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MS6DSV_INT_GPIO_PIN_Pin GPIO_PIN_6
#define MS6DSV_INT_GPIO_PIN_GPIO_Port GPIOF
#define LED0_Pin GPIO_PIN_9
#define LED0_GPIO_Port GPIOF
#define LED1_Pin GPIO_PIN_10
#define LED1_GPIO_Port GPIOF
#define MS6DSV_SA0_GPIO_PIN_Pin GPIO_PIN_0
#define MS6DSV_SA0_GPIO_PIN_GPIO_Port GPIOC
#define MS6DSV_IIC_SCL_Pin GPIO_PIN_10
#define MS6DSV_IIC_SCL_GPIO_Port GPIOB
#define MS6DSV_IIC_SDA_Pin GPIO_PIN_11
#define MS6DSV_IIC_SDA_GPIO_Port GPIOB
#define LCD_BL_Pin GPIO_PIN_15
#define LCD_BL_GPIO_Port GPIOB
#define L_IN1_Pin GPIO_PIN_4
#define L_IN1_GPIO_Port GPIOB
#define L_IN2_Pin GPIO_PIN_5
#define L_IN2_GPIO_Port GPIOB
#define R_IN1_Pin GPIO_PIN_6
#define R_IN1_GPIO_Port GPIOB
#define R_IN2_Pin GPIO_PIN_7
#define R_IN2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
